{
  "Rooms" : [
    {
      "index": 0,
      "name":  "Main Room",
      "door desc": "",
      "intro": "",
      "short desc":  " You are in a room that looks like your bedroom, but a few things seem different.\n",
      "long desc":  " You see a room that looks like the room you usually sleep in.",
      "is locked": false,
      "is visible": false,
      "direction": "center"
    },
  {
      "index": 1,
      "name":  "1980 Room",
    "door desc": "A freshly painted bright yellow door.",
    "intro": " You realize you are in a different place and time. Your surroundings are very familiar.\n",
      "short desc":  " You are in what appears to be your childhood bedroom.",
      "long desc":  " You are still in a bedroom, but as you look around you notice the walls adorned with posters of movies, including Star Wars, Back to the Future, and Indiana Jones. The posters are carefully placed to cover the blue paint on the walls, giving the room a cozy and immersive feel.\n\n The bed is a twin-sized mattress, situated against the wall with a colorful patchwork quilt covering it. There are stuffed animals and pillows of all shapes and sizes piled up at the head of the bed. A lamp with a green shade is placed on the nightstand next to the bed, providing the perfect amount of light for reading.\\n\\nThe carpet is beige and soft, with a few small stains from spilled drinks and snacks. A small bookshelf is placed next to the desk, filled with classic books like \"The Hobbit\" and \"The Chronicles of Narnia.\" A few action figures and a Rubik's Cube are also scattered on the shelves.\n\n The curtains are thick and dark blue, keeping the sunlight out during the day. A few posters of music artists, like Michael Jackson and Prince, are placed in between the movie posters, adding some musical flair to the room.\n\n This is a bedroom straight out of the 1980s. It is a cozy and nostalgic space, perfect for immersing yourself in the adventures of your favorite movies and video games.\n\n",
      "is locked": false,
    "is visible": false,
    "direction": "north"
    },
     {
       "index": 2,
      "name":  "1970 Room",
       "door desc": "A glittery door with sequence patters.",
       "intro": " You realize you are in a different place and time. But the first thing you \nnotice isn't your surroundings, it is the music.\n\nThe music here is absolutely pumping. It is filled with a high-energy dance\nbeat, and you can feel it in every fiber of your being. The bassline is\nthumping through the floor, and the strings are swelling in a way that just\nmakes you want to move. There's a sense of urgency and excitement in the music,\nlike it's pushing you to get up and dance.\n\nAnd the vocals . . . the vocals are pure joy. The singers are belting out these\ncatchy, upbeat melodies that just make you want to sing along. It's all about\nhaving a good time, letting loose, and forgetting your troubles for a while.\n",
      "short desc":  "You are in a disco. There are people dancing, there is loud music, and you\nimmediately think about joining them. Then you remember you don't know any\ndisco dances.\n\nThere is so much going on on the dance floor that it might be worth a second\nlook.\n\nThere is a disco ball hanging above the dance floor that also captures your\nattention.\n",
      "long desc":  "You finally break free from the hold of the music and decide to take in your\nsurroundings.\n\nYou are in a big room with loud music, lights, and people dancing. There\nappears to be a DJ in one corner playing . . . records.\n\nThe decor of the room is flashy and colorful, with neon lights everywhere. The\npeople are dressed fashionably and glamorous, wearing sequined and glittery\nclothing, platform shoes, and knee-high boots. There are lights are flashing\nall around, and everyone is dressed to impress. You can feel the energy of the\ncrowd. It's like one big party, and you're a part of it.\n\nThe combination of the music, the clothes, and the atmosphere hits you.\n\nYou are in a disco.\n\nThe dance floor is in the center of the room.\n",
      "is locked": false,
       "is visible": false,
       "direction": "north east"
    },
     {
       "index": 3,
      "name":  "1960 Room",
       "door desc": "A multicolored door with a peace sign on it.",
       "intro": "",
      "short desc":  "Short description of 1960 Room.",
      "long desc":  "This is the long description of 1960 Room.",
      "is locked": true,
        "is visible": false,
       "direction": "east"
    },
     {
       "index": 4,
      "name":  "1990 Room",
       "door desc": "A bright blue door with a pager on it.",
       "intro": " When you look around after your latest time-traveling jaunt you are not in a\nbedroom or a disco or someone's farm turned concert venue. You are\nimmediately hit by a blast of noise and activity. People of all ages are\nbustling around, jostling for space, and queuing up to get something to eat.\n\n",
      "short desc":  " You are in a shopping mall food court. Based on what you see you think it is\nsometime in the 1990s.\n\n",
      "long desc":  " You are in a . . . food court? In a shopping mall?\n\nThe food court itself is a large, open area, filled with dozens of stalls and\nrestaurants, each with its own distinct aroma and vibe. The decor is modern,\nwith neon lights, metallic finishes, and plastic seating. There's a distinct\nhum of excitement in the air, with shoppers and hungry people alike rubbing\nshoulders and enjoying the lively atmosphere.\n\nThe variety of food options is staggering. You can find fast food staples like\na bunch of burger joints with their familiar logos and signature menus. There's\nalso a host of international cuisine options, including Chinese, Italian, and\nMexican food. You can order whatever you want and then sit down at a table to\nsavor your meal.\n\nThe smells are amazing, with the tantalizing aroma of freshly cooked food\nwafting across the food court. The sound of sizzling burgers, frying chicken,\nand sizzling stir-fries fills the air, punctuated by the occasional beep of a\ncash register or the clattering of cutlery.\n\nAs you walk around the food court, you can see groups of people chatting and\nlaughing, tucking into their meals, and enjoying the bustling atmosphere. The\nseating areas are crowded, but there's a friendly vibe, with strangers striking\nup conversations and sharing stories.\n\n",
      "is locked": false,
        "is visible": false,
       "direction": "south east"
    },
     {
       "index": 5,
      "name":  "Room Five",
       "door desc": "2000 Room",
       "intro": "",
      "short desc":  "Short description of 2000 Room.",
      "long desc":  "This is the long description of 2000 Room.",
      "is locked": false,
        "is visible": false,
       "direction": "south"
    },
     {
       "index": 6,
      "name":  "Room six",
       "door desc": "",
       "intro": "",
      "short desc":  "This is the short description",
      "long desc":  "This is the long description",
      "is locked": false,
        "is visible": false,
       "direction": " south west"
    },
     {
       "index": 7,
      "name":  "Room seven",
       "door desc": "",
       "intro": "",
      "short desc":  "This is the short description",
      "long desc":  "This is the long description",
      "is locked": false,
        "is visible": false,
       "direction": "west"
    },
     {
       "index": 8,
      "name":  "Room eight",
       "door desc": "",
       "intro": "",
      "short desc":  "This is the short description",
      "long desc":  "This is the long description",
      "is locked": false,
        "is visible": false,
       "direction": "north west"
    },
     {
       "index": 9,
      "name":  "Room nine",
       "door desc": "",
       "intro": "",
      "short desc":  "This is the short description",
      "long desc":  "This is the long description",
      "is locked": false,
        "is visible": false,
       "direction": "down"
    }
  ],

  "Game Objects": [
    {
    "object name": "Desk",
      "short desc": " Against the wall there is a desk where you can see a few items.",
      "description": " This desk is not IKEA. It seems to be made of a rich mahogany.",
    "location": 0,
      "is movable": false,
      "is visible": true
    },

    {
    "object name": "TV",
       "short desc": " An older television. It is a TV/VCR combo. An old television that plays videotapes...",
      "description": " \n An old television that plays videotapes. You know, it's how people watched movies in the '80s. They look\n like big cassette tapes . . . you know, those things that . . . never mind.",
    "location": 0,
      "is movable": false,
      "is visible": true
    },

    {
      "object name": "Tablet",
       "short desc": " What appears to be a type of tablet.",
      "description": " \n A transparent item that looks like a tablet but you are not quite sure what it\n is. It definitely looks more modern than the tv.",
      "location": 0,
      "is movable": true,
      "is visible": false
    },

    {
      "object name": "Letter",
       "short desc": " A piece of paper that looks like it has something written on it.",
      "description": " \n I can't believe all you had to do was type 'place bar' and you would have won!\n Then you could have gone to the mailbox, to the barrow, and game over!\n\n You don't know what this means, but it seems important.\n\n",
      "location": 0,
      "is movable": true,
      "is visible": false
    },

    {
      "object name": "Poster",
       "short desc": " There is a poster on the wall, but it's the poster you had on\n your wall as a child. At least you think it is...",
      "description": " \n The poster appears to be blank. . . ",
      "location": 0,
      "is movable": false,
      "is visible": true
    },
    {
      "object name": "Remote",
       "short desc": "A black standard remote. You remember this remote.",
      "description": " \n The remote is very simple. You are tempted to use it . . . ",
      "location": 1,
      "is movable": true,
      "is visible": false
    },

     {
      "object name": "Commodore",
        "short desc": "A Commodore that you remember from your childhood. How cool!",
      "description": " \n In the exciting world of technology, let me take you back to the 1980s,\n a time when personal computers were just starting to become popular. \nOne of the most iconic machines of that era was the Commodore 64, a true marvel that captured \nthe hearts and minds of computer enthusiasts everywhere.\n",
      "location": 1,
      "is movable": false,
       "is visible": true
    },
     {
      "object name": "Desk",
        "short desc": " A Desk with what appears to be a Commodore computer on it and perhaps something else.",
      "description": " \n The desk is what you remember from [Details].",
      "location": 1,
      "is movable": false,
       "is visible": true
    },
    {
      "object name": "Disco-Ball",
       "short desc": " There is a disco ball hanging above the dance floor that also captures your attention.",
      "description": " \n Wow, check out that disco ball up there! It's massive, covered in shimmering mirrors \n that are reflecting the colorful lights all over the dance floor. \n It's the centerpiece of the whole room, and it's casting a mesmerizing glow \n that just makes you want to dance.\n\n The ball is hanging from the ceiling, and it's slowly spinning, \n sending flashes of light in all directions. As it rotates, the mirrored \n tiles catch the light and send it bouncing around the room, creating \n a sparkling, magical effect. It's like a miniature universe up there, \n with thousands of little stars that are pulsing and twinkling \n with the rhythm of the music.\n\n When you see that disco ball up there, you know you're in a \n place where anything can happen, where anything is possible.\n",
      "location": 2,
      "is movable": false,
      "is visible": true
    },
    {
      "object name": "Dance-Floor",
       "short desc": "  \n There is so much going on on the dance floor that it might be worth a second look.",
      "description": " \n The dance floor is a large, open space that is the centerpiece of the club \n and the focal point for everyone in the room. It is illuminated with bright,\n flashing lights that create visual display.\n\n You notice everyone on the floor is moving together in sync to the beat of the music.\n The dance has a pattern. After watching a while, you figure it out.\n\n Left arm\n Right arm\n Right leg\n Left leg\n Spin\n\n For some reason you think you should remember this pattern.\n",
      "location": 2,
      "is movable": false,
      "is visible": true
    },
     {
      "object name": "Blacklight",
        "short desc": " \n There is something that looks like a light bulb, but it is purple.",
      "description": " \n Somehow you remember that blacklights emit ultraviolet light (must have\n been the discovery channel), and when this light shines on certain types\n of paint of ink, it makes that paint or ink glow.\n\n You wonder if there are any hidden messages in the disco that you could\n see with the blacklight.\n",
      "location": 2,
      "is movable": true,
       "is visible": true
    }
  ],
  "Current Room": 0
}